OdTimeStamp.packedValue
\details
Returns this TimeStamp object as long.
\remarks
packedValue returns the number of seconds elapsed since midnight, January 1, 1970, Universal (Greenwich Mean) Time.
If this TimeStamp object contains a date before midnight, January 1, 1970,  UTC,
or after 3:14:07 on January 19, 2038, UT, packedValue() returns -1.

OdTimeStamp.strftime(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns this TimeStamp object as a user-formatted string.
\param timeString [out]  Receives the formatted time string.
\param format [in]  Format string.
\remarks
The formatting codes for the format string are as follows; the # suppresses leading zeros:
Code          Description
%a            Short weekday
%A            Full weekday
%b            Short month
%B            Full month
%c            Short date and time for current locale
%#c           Long date and time for current locale
%d            Day of month (01 - 31)
%#d           Day of month (1 - 31)
%H            Hour in 24 hour format (00 - 23)
%#H           Hour in 24 hour format (0 - 23)
%I            Hour in 12 hour format (01 - 12)
%#I           Hour in 12 hour format (1 - 12)
%j            Day of year (001 - 366)
%#j           Day of year (1 - 366)
%m            Month (01 - 12)
%#m           Month (1 - 12)
%M            Minute (00 - 59)
%#M           Minute (0 - 59)
%p            AM/PM indicator for current local
%S            Second (00 - 59)
%#S           Second (0 - 59)
%U            Week of the year, first day of week is Sunday (00 - 53)
%#U           Week of the year, first day of week is Sunday (0 - 53)
%w            Weekday, Sunday is 0, (0 - 6)
%#w           Weekday, Sunday is 0, (0 - 6)
%W            Week of the year, first day of week is Monday (00 - 53)
%#W           Week of the year, first day of week is Monday (0 - 53)
%x            Date for the current locale
%X            Time for the current locale
%y            Year without century (00 - 99)
%#y           Year without century (0 - 99)
%Y            Year with century
%Y            Year with century, no leading zeros
%z            Time-zone name
%Z            Time zone abbreviation

OdTimeStamp.subtract(OdTimeStamp!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Subtracts the specified TimeStamp object from this TimeStamp object, and returns the difference.
\param tStamp [in]  TimeStamp.

OdTimeStamp.add(OdTimeStamp!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Adds the specified TimeStamp object to this TimeStamp object, and returns the sum.
\param tStamp [in]  TimeStamp.

OdTimeStamp.setJulianFraction(System.Double)
\details
Sets the fraction of the Julian date of this TimeStamp object.
\param julianFraction [in]  Julian fraction.
\remarks
The Julian fraction is the fraction of the day since midnight.

OdTimeStamp.julianFraction
\details
Returns the fraction of the Julian date of this TimeStamp object.
\remarks
The Julian fraction is the fraction of the day since midnight.

OdTimeStamp.setJulianDate(System.UInt32!System.Runtime.CompilerServices.IsLong,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the Julian Date for this TimeStamp object.
\param julianDay [in]  Julian day.
\param msecsPastMidnight [in]  Milliseconds past midnight.

OdTimeStamp.setMsecsPastMidnight(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the milliseconds past midnight for this TimeStamp object.
\param msecsPastMidnight [in]  Milliseconds past midnight.

OdTimeStamp.msecsPastMidnight
\details
Returns the milliseconds past midnight for this TimeStamp object.

OdTimeStamp.setJulianDay(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the Julian day of this TimeStamp object.
\param julianDay [in]  Julian day.

OdTimeStamp.julianDay
\details
Returns the Julian day of this TimeStamp object.

OdTimeStamp.universalToLocal
\details
Converts this TimeStamp object from Universal (Greenwich Mean) Time to local time.

OdTimeStamp.localToUniversal
\details
Converts this TimeStamp object from local time to Universal (Greenwich Mean) Time.

OdTimeStamp.getUniversalTime
\details
Sets this TimeStamp object to the workstation date in Universal (Greenwich Mean) Time.

OdTimeStamp.getLocalTime
\details
Sets this TimeStamp object to the workstation date in local time.

OdTimeStamp.setToZero
\details
Sets this TimeStamp object to Midnight, January 1, 1970, UTC.

OdTimeStamp.setMillisecond(System.Int16)
\details
Sets the millisecond of this TimeStamp object.
\param millisecond [in]  Millisecond.

OdTimeStamp.millisecond
\details
Returns the millisecond of this TimeStamp object.

OdTimeStamp.setSecond(System.Int16)
\details
Sets the second of this TimeStamp object.
\param second [in]  Second.

OdTimeStamp.second
\details
Returns the second of this TimeStamp object.

OdTimeStamp.setMinute(System.Int16)
\details
Sets the minute of this TimeStamp object.
\param minute [in]  Minute.

OdTimeStamp.minute
\details
Returns the minute of this TimeStamp object.

OdTimeStamp.setHour(System.Int16)
\details
Sets the hour of this TimeStamp object.
\param hour [in]  Hour.

OdTimeStamp.hour
\details
Returns the hour of this TimeStamp object.

OdTimeStamp.setTime(System.Int16,System.Int16,System.Int16,System.Int16)
\details
Sets the time of this TimeStamp object.
\param hour [in]  Hour.
\param minute [in]  Minute.
\param second [in]  Second.
\param millisecond [in]  Millisecond.

OdTimeStamp.getTime(System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the time of this TimeStamp object.
\param hour [out]  Receives the hour.
\param minute [out]  Receives the minute.
\param second [out]  Receives the second.
\param millisecond [out]  Receives the millisecond.

OdTimeStamp.setYear(System.Int16)
\details
Sets the year of this TimeStamp object.
\param year [in]  Year.

OdTimeStamp.year
\details
Returns the year of this TimeStamp object.

OdTimeStamp.setDay(System.Int16)
\details
Sets the day of this TimeStamp object.
\param day [in]  Day.

OdTimeStamp.day
\details
Returns the day of this TimeStamp object.

OdTimeStamp.setMonth(System.Int16)
\details
Sets the month of this TimeStamp object.
\param month [in]  Month.

OdTimeStamp.month
\details
Returns the month of this TimeStamp object.

OdTimeStamp.setDate(System.Int16,System.Int16,System.Int16)
\details
Sets the date of this TimeStamp object.
\param month [in]  Month.
\param day [in]  Day.
\param year [in]  Year.
\returns  OdResult::eOk if set is successful, OdResult::eOutOfRange otherwise

OdTimeStamp.getDate(System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int16*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the date of this TimeStamp object.
\param month [out]  Receives the month.
\param day [out]  Receives the day.
\param year [out]  Receives the year.

OdTimeStamp.#ctor
\param init [in]  Initial value.
\remarks
The default constructor initializes the Julian date and time to midnight, January 1, 1970,  UTC.
init must be one of the following:
Name                 Value    Description
kInitZero            1        Midnight, January 1, 1970, UTC.
kInitLocalTime       2        Workstation date in local time.
kInitUniversalTime   3        Workstation date in Universal (Greenwich Mean) Time.